import { User } from './types';

export const SYSTEM_VERSION = "tenko V.01  บริษัท ออโต้แครี่เออร์";

export const DRIVERS: { id: string; name: string }[] = [
  { id: "240", name: "นายนิรุท สาเกตุ" },
  { id: "244", name: "นายสายฝน พลหมั่น" },
  { id: "263", name: "นายกิติพงษ์ ดวงงาม" },
  { id: "291", name: "นายสมรถ แข่งกระโทก" },
  { id: "342", name: "นายเมืองมล ชาบุญมา" },
  { id: "346", name: "นายสกนธ์ จันเวิน" },
  { id: "373", name: "นายประกิจ แสนแดง" },
  { id: "408", name: "นายอนุชา ชาบุญมา" },
  { id: "422", name: "นายสายยนต์ ชาบุญมา" },
  { id: "470", name: "นายอำนาจ สวัสดิ์รักษา" },
  { id: "517", name: "นายจิรวรรณ บุญแท่ง" },
  { id: "539", name: "นายวัฒนพงษ์ ศรีทิน" },
  { id: "541", name: "นายเสริมศักดิ์ พิมมา" },
  { id: "550", name: "นายอภิชาติ เรืองเทศ" },
  { id: "598", name: "นายสมชาติ แสงเพชร" },
  { id: "655", name: "นายวันชัย สารจันทร" },
  { id: "659", name: "นายบุญเยี่ยม คำยา" }
];

export const TENKO_USERS: { id: string; name: string }[] = [
  { id: "009", name: "นายชัยสิทธิ์ ธัญญพืช" },
  { id: "567", name: "นายจินตวัฒน์ ทองแพรว" },
  { id: "704", name: "นายวสันต์ แจ้งคง" },
  { id: "755", name: "นายกฤตกร บุญเซ่ง" }
];